# DistributionTypeInvalid Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AutoRouteFailures..::..DistributionTypeInvalid Property
BuiltInFailures..::..AutoRouteFailures Class See Also
---
Selected distribution system type is invalid!
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DistributionTypeInvalid { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DistributionTypeInvalid As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DistributionTypeInvalid {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AutoRouteFailures Class
Autodesk.Revit.DB Namespace